s1 = "Пропоганда"
s2 = "Сенсация"
s3 = "Сенсация*Сенсация*Сенсация*Сенсация"
s4 = 'ОхОхОхАх'
напечатать ( 's1=' , s1 )
напечатать ( 's2=' , s2 )
напечатать ( 's3=' , s3 )
напечатать ( 's4=' , s4 )
напечатать ( 's1+s2=' , s1 + s2 )
напечатать ( 's1*3 = ' , s1 * 3 )
напечатать ( 's1[]= ' , s1 [ 2 ])
напечатать ( 's1[2,4]=' , s1 [ 2 : 4 ])

печать ( 's3.count = ' , s3.count ( s2 ) )

print ( 's1.find(' 'a' ')=' , s1.find ( ' a ' ))

print ( 's1.index(' 'п' ')=' , s1.index ( ' п ' ))

print ( 's1.rindex(' 'д' ')=' , s1.rindex ( ' a ' ))

print ( 's4.replace(' 'Ox' ',' 'Ax' ',2)=' , s4.replace ( ' Ox ' < 'Ax' , 2 ))


print ( 's3.split(' '*' ') =' , s3.split ( ' * ' ))
печать ( 's1.upper=' , s1.upper ( ) )
print ( 's1.lower=' , s1.lower ( ) )